yang-8/run/adjointScalarSimpleFoam/DominikFlow/0/U_final
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
21600
(
(-1.44661e-06 1.43519e-06 0)
(-6.99359e-06 2.16515e-06 0)
(-1.27319e-05 1.97047e-06 0)
(-1.61406e-05 1.3038e-06 0)
(-1.5419e-05 4.63136e-07 0)
(-9.77919e-06 -4.39686e-07 0)
(1.08691e-06 -1.34367e-06 0)
(1.72293e-05 -2.21553e-06 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    fixedWalls
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
